#include "general.h"
/*
 * 当m和n其中有任意一个数是0时，返回1
    当m = 1时:
    n = 1,灯有开或关两种状态，故答案为2；
    n = 2,灯有3种状态：00,01,10，故答案为3；
    n = 3,灯有4种状态：000,101,010,011，故答案为4；
    n = 4,灯有4种状态：0000,1010,0101,0110，故答案为4；
    结合n = 3, n = 4，当 n > 3时，答案均为4。
    当m = 2时:
    n = 1,灯有开或关两种状态，故答案为2；
    n = 2,灯有4种状态：11,01,10,00，故答案为4；
    n = 3,灯有7种状态：111,101.010,100,000,001,110, 故答案为7；
    同上，当 n > 3时，答案均为7。
    当m = 3时:
    n = 1,灯有开或关两种状态，故答案为2；
    n = 2,灯有4种状态：00,01,10,11，故答案为4；
    n = 3,灯有8种状态：111,101.010,100,000,001,110,011, 故答案为8；
    同上，当 n > 3时，答案均为8。
    当m > 3时，答案应与m = 3相同。
 */
int flipLights(int n, int m) {
    // write your code here
    if (m == 1) {
        if (n == 2) {
            return 3;
        }
        return min(4, 1 << n);
    }
    if (m == 2) {
        return min(7, 1 << n);
    }
    return min(8, 1 << min(m, n));
}
int main()
{

}